#include<stdio.h>
#include<windows.h>

using namespace std;

char s1[20] = { 'А','л','ю','м','и','н','и','й' }, s2[20] = { 'В','и','с','м','у','т' }, s3[20] = { 'С','в','и','н','е','ц' };
int num1 = 13, num2 = 83, num3 = 82;
int temp1 = 700, temp2 = 304, temp3 = 441;
float v1 = 2.9, v2 = 1.65, v3 = 2.11;
/*
char s1[20], s2[20], s3[20];
int num1, num2, num3;
int temp1, temp2, temp3;
float v1, v2, v3;
*/
int main() {

	SetConsoleOutputCP(1251);
	SetConsoleCP(1251);

	// Алюминий 13 700 2.9
	// Вимсут 83 304 1.65
	// Свинец 82 441 2.11

	printf("1. Введите вещество, атомный номер, температуру (град.С) и вязкость (кг/м*сек)> ");
	//scanf_s("%s%d%d%f", s1, (unsigned)_countof(s1), &num1, &temp1, &v1);

	printf("2. Введите вещество, атомный номер, температуру (град.С) и вязкость (кг/м*сек)> ");
	//scanf_s("%s%d%d%f", s2, (unsigned)_countof(s2), &num2, &temp2, &v2);

	printf("3. Введите вещество, атомный номер, температуру (град.С) и вязкость (кг/м*сек)> ");
	//scanf_s("%s%d%d%f", s3, (unsigned)_countof(s3), &num3, &temp3, &v3);

	printf("-------------------------------------------------------------------------------\n");
	printf("| Вязкость металлов в жидком состоянии                                        |\n");
	printf("-------------------------------------------------------------------------------\n");
	printf("| Вещество  | Атомный номер   | Температура (град.С)  | Вязкость (кг/м*сек)   |\n");
	printf("|-----------|-----------------|-----------------------|-----------------------|\n");
	printf("| %9s | %-16d| %-22d| %-22.2f|\n", s1, num1, temp1, v1);
	printf("|-----------|-----------------|-----------------------|-----------------------|\n");
	printf("| %9s | %-16d| %-22d| %-22.2f|\n", s2, num2, temp2, v2);
	printf("|-----------|-----------------|-----------------------|-----------------------|\n");
	printf("| %9s | %-16d| %-22d| %-22.2f|\n", s3, num3, temp3, v3);
	printf("|-----------------------------------------------------------------------------|\n");
	printf("| Примечание: данные даны для температуры плавления                           |\n");
	printf("-------------------------------------------------------------------------------\n");
}