#include<iostream>
#include"head_file.h"
using namespace std;
void outputting(element* el, int size) {
	printf("-------------------------------------------------------------------------------\n");
	printf("| Вязкость металлов в жидком состоянии                                        |\n");
	printf("-------------------------------------------------------------------------------\n");
	printf("| Вещество  | Атомный номер   | Температура (град.С)  | Вязкость (кг/м*сек)   |\n");

	for (int i = 0; i < size; ++i) {
		printf("|-----------|-----------------|-----------------------|-----------------------|\n");
		printf("| %9s | %-16d| %-22d| %-22.2f|\n", el[i].name, el[i].num, el[i].temperature, el[i].viscosity);
	}
	printf("|-----------------------------------------------------------------------------|\n");
	printf("| Примечание: данные даны для температуры плавления                           |\n");
	printf("-------------------------------------------------------------------------------\n\n\n");
}